recursos/xml/ReqConsultasProductos.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://www.davivienda.com/xml/ConsultasProductos">
   <soapenv:Header/>
   <soapenv:Body>
      <con:ConsultasProductos>
         <Request>
            <DataHeader>
               <nombreOperacion>ConsultasProductos</nombreOperacion>
               <total>?</total>
               <jornada>?</jornada>
               <canal>?</canal>
               <modoDeOperacion>?</modoDeOperacion>
               <usuario>?</usuario>
               <perfil>?</perfil>
               <versionServicio>1.0.0</versionServicio>
               <idTransaccion>?</idTransaccion>
            </DataHeader>
            <Data>
               <valNumeroIdentificacion>?</valNumeroIdentificacion>
               <valTipoIdentificacion>?</valTipoIdentificacion>
               <valCompania>?</valCompania>
               <valVinculacion>?</valVinculacion>
               <codProducto>?</codProducto>
               <codSubProducto>?</codSubProducto>
               <valNumeroProducto>?</valNumeroProducto>
               <valIndicadorConsultarCuentasAhorros>?</valIndicadorConsultarCuentasAhorros>
               <valIndicadorConsultarCuentasCorrientes>?</valIndicadorConsultarCuentasCorrientes>
               <valIndicadorConsultarCreditosFM>?</valIndicadorConsultarCreditosFM>
               <valIndicadorConsultarTarjetasCreditoPropias>?</valIndicadorConsultarTarjetasCreditoPropias>
               <valIndicadorConsultarTarjetasCreditoAmparadas>?</valIndicadorConsultarTarjetasCreditoAmparadas>
               <valIndicadorConsultarDabuenvida>?</valIndicadorConsultarDabuenvida>
               <valIndicadorConsultarCertificadoCDTS>?</valIndicadorConsultarCertificadoCDTS>
               <valIndicadorConsultarEstablecimientos>?</valIndicadorConsultarEstablecimientos>
               <valIndicadorConsultarFondosInversion>?</valIndicadorConsultarFondosInversion>
            </Data>
         </Request>
      </con:ConsultasProductos>
   </soapenv:Body>
</soapenv:Envelope>